[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:31:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="UCSBDiningCommonsMenuItemForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="UCSBDiningCommonsMenuItemForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>
+                    </Col>}
 
                 <Col>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:31:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="UCSBDiningCommonsMenuItemForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
 
                 <Col>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly when passing in a UCSBDiningCommonsMenuItem
statusReason: Error: Unable to find an element by: [data-testid="/UCSBDiningCommonsMenuItemForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:55:75
                             id="diningCommonsCode"
                             type="text"
                             isInvalid={Boolean(errors.diningCommonsCode)}
-                            {...register("diningCommonsCode", { required: true, pattern: diningCommonsCode_regex })}
+                            {...register("diningCommonsCode", { required: false, pattern: diningCommonsCode_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /diningCommonsCode is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:58:30
                             {...register("diningCommonsCode", { required: true, pattern: diningCommonsCode_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.diningCommonsCode && 'diningCommonsCode is required. '}
+                            {false}
                             {errors.diningCommonsCode?.type === 'pattern' && 'diningCommonsCode must be numeric, e.g. 100'}
                         </Form.Control.Feedback>
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /diningCommonsCode is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:58:30
                             {...register("diningCommonsCode", { required: true, pattern: diningCommonsCode_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.diningCommonsCode && 'diningCommonsCode is required. '}
+                            {errors.diningCommonsCode || 'diningCommonsCode is required. '}
                             {errors.diningCommonsCode?.type === 'pattern' && 'diningCommonsCode must be numeric, e.g. 100'}
                         </Form.Control.Feedback>
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] OptionalChaining
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:59:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.diningCommonsCode && 'diningCommonsCode is required. '}
-                            {errors.diningCommonsCode?.type === 'pattern' && 'diningCommonsCode must be numeric, e.g. 100'}
+                            {errors.diningCommonsCode.type === 'pattern' && 'diningCommonsCode must be numeric, e.g. 100'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:59:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.diningCommonsCode && 'diningCommonsCode is required. '}
-                            {errors.diningCommonsCode?.type === 'pattern' && 'diningCommonsCode must be numeric, e.g. 100'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /diningCommonsCode must be numeric, e.g. 100/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
