[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:9:31
 
 export default function UCSBDiningCommonsMenuItemCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (menuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitems/post",
-    method: "POST",
-    params: {
-     diningCommonsCode: menuItem.diningCommonsCode,
-     name: menuItem.name,
-     station: menuItem.station
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitems
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:19:35
     }
   });
 
-  const onSuccess = (menuItem) => {
-    toast(`New menu item Created - id: ${menuItem.id} name: ${menuItem.name}`);
-  }
+  const onSuccess = (menuItem) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitems
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New menu item Created - id: 1 name: Apple Pie"

Number of calls: 0
