[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:81:22
                 />
                 <Form.Control.Feedback type="invalid">
                     {errors.url?.message}
-                    {errors.url?.type === 'pattern' && 'URL must be a valid web address. '}
+                    {true && 'URL must be a valid web address. '}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ArticlesForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /URL/

Here are the matching elements:

<label
  class="form-label"
  for="url"
>
