[Killed] Regex
main/components/HelpRequest/HelpRequestForm.js:27:26
 
     // Stryker disable next-line all
     const email_regex = /[\w.]+@([\w]+\.)+[\w-]{2,4}/i;
-    const teamId_regex = /[smfw]\d\d-([123456789]|10|11|12)(am|pm)-[1234]$/;
+    const teamId_regex = /[smfw]\D\d-([123456789]|10|11|12)(am|pm)-[1234]$/;
     const solved_regex = /(true|false)/i;
 
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] Regex
main/components/HelpRequest/HelpRequestForm.js:27:26
 
     // Stryker disable next-line all
     const email_regex = /[\w.]+@([\w]+\.)+[\w-]{2,4}/i;
-    const teamId_regex = /[smfw]\d\d-([123456789]|10|11|12)(am|pm)-[1234]$/;
+    const teamId_regex = /[smfw]\d\D-([123456789]|10|11|12)(am|pm)-[1234]$/;
     const solved_regex = /(true|false)/i;
 
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:58:64
                             id="teamId"
                             type="text"
                             isInvalid={Boolean(errors.teamId)}
-                            {...register("teamId", { required: true, pattern: teamId_regex })}
+                            {...register("teamId", { required: false, pattern: teamId_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /TeamId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:61:30
                             {...register("teamId", { required: true, pattern: teamId_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.teamId && 'TeamId is required.'}
+                            {true}
                             {errors.teamId?.type === 'pattern' && 'TeamId must be in the correct format, e.g. f23-6pm-4'}
                         </Form.Control.Feedback>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /TeamId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:62:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.teamId && 'TeamId is required.'}
-                            {errors.teamId?.type === 'pattern' && 'TeamId must be in the correct format, e.g. f23-6pm-4'}
+                            {errors.teamId?.type === 'pattern' || 'TeamId must be in the correct format, e.g. f23-6pm-4'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests renders correctly when passing in a HelpRequest
statusReason: TestingLibraryElementError: Found multiple elements with the text: /Id/

Here are the matching elements:

<label
  class="form-label"
  for="id"
>

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:62:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.teamId && 'TeamId is required.'}
-                            {errors.teamId?.type === 'pattern' && 'TeamId must be in the correct format, e.g. f23-6pm-4'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /TeamId must be in the correct format, e.g. f23-6pm-4/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:74:77
                             id="tableOrBreakoutRoom"
                             type="text"
                             isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-                            {...register("tableOrBreakoutRoom", { required: true })}
+                            {...register("tableOrBreakoutRoom", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or BreakoutRoom is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:77:30
                             {...register("tableOrBreakoutRoom", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.tableOrBreakoutRoom && 'Table or BreakoutRoom is required.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or BreakoutRoom is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:77:30
                             {...register("tableOrBreakoutRoom", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.tableOrBreakoutRoom && 'Table or BreakoutRoom is required.'}
+                            {errors.tableOrBreakoutRoom || 'Table or BreakoutRoom is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:96:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.requesterEmail && 'RequesterEmail is required.'}
-                            {errors.requesterEmail?.type === 'pattern' && 'RequesterEmail must be in the email format, e.g. cgacho@ucsb.edu'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /RequesterEmail must be in the email format, e.g. cgacho@ucsb.edu/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:96:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.requesterEmail && 'RequesterEmail is required.'}
-                            {errors.requesterEmail?.type === 'pattern' && 'RequesterEmail must be in the email format, e.g. cgacho@ucsb.edu'}
+                            {true && 'RequesterEmail must be in the email format, e.g. cgacho@ucsb.edu'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">RequesterEmail must be in the email format, e.g. cgacho@ucsb.edu</div> instead

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:129:30
                             {...register("explanation", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.explanation && 'Explanation is required.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:144:64
                             id="solved"
                             type="text"
                             isInvalid={Boolean(errors.solved)}
-                            {...register("solved", { required: true,  pattern: solved_regex})}
+                            {...register("solved", { required: false,  pattern: solved_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Solved is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:144:42
                             id="solved"
                             type="text"
                             isInvalid={Boolean(errors.solved)}
-                            {...register("solved", { required: true,  pattern: solved_regex})}
+                            {...register("", { required: true,  pattern: solved_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:148:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.solved && 'Solved is required.'}
-                            {errors.solved?.type === 'pattern' && 'Solved must be true or false'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Solved must be true or false/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:148:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.solved && 'Solved is required.'}
-                            {errors.solved?.type === 'pattern' && 'Solved must be true or false'}
+                            {errors.solved?.type === 'pattern' || 'Solved must be true or false'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Solved must be true or false/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
