[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:36:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="RecommendationRequestForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="RecommendationRequestForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>
+                    </Col>}
 
                 <Col>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:60:72
                             id="requesterEmail"
                             type="text"
                             isInvalid={Boolean(errors.requesterEmail)}
-                            {...register("requesterEmail", { required: true, pattern: email_ragex })}
+                            {...register("requesterEmail", { required: false, pattern: email_ragex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Requester Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:60:42
                             id="requesterEmail"
                             type="text"
                             isInvalid={Boolean(errors.requesterEmail)}
-                            {...register("requesterEmail", { required: true, pattern: email_ragex })}
+                            {...register("", { required: true, pattern: email_ragex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:64:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.requesterEmail && 'Requester Email is required. '}
-                            {errors.requesterEmail?.type === 'pattern' && 'Requester Email must in the form of an email, e.g. sample@email.com'}
+                            {errors.requesterEmail.type === 'pattern' && 'Requester Email must in the form of an email, e.g. sample@email.com'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:64:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.requesterEmail && 'Requester Email is required. '}
-                            {errors.requesterEmail?.type === 'pattern' && 'Requester Email must in the form of an email, e.g. sample@email.com'}
+                            {errors.requesterEmail?.type === 'pattern' || 'Requester Email must in the form of an email, e.g. sample@email.com'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Requester Email/

Here are the matching elements:

<label
  class="form-label"
  for="requesterEmail"
>

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:76:72
                             id="professorEmail"
                             type="text"
                             isInvalid={Boolean(errors.professorEmail)}
-                            {...register("professorEmail", { required: true, pattern: email_ragex })}
+                            {...register("professorEmail", { required: false, pattern: email_ragex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Professor Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:76:42
                             id="professorEmail"
                             type="text"
                             isInvalid={Boolean(errors.professorEmail)}
-                            {...register("professorEmail", { required: true, pattern: email_ragex })}
+                            {...register("", { required: true, pattern: email_ragex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:79:30
                             {...register("professorEmail", { required: true, pattern: email_ragex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.professorEmail && 'Professor Email is required. '}
+                            {true}
                             {errors.professorEmail?.type === 'pattern' && 'Professor Email must in the form of an email, e.g. sample@email.com'}
                         </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Professor Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:80:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.professorEmail && 'Professor Email is required. '}
-                            {errors.professorEmail?.type === 'pattern' && 'Professor Email must in the form of an email, e.g. sample@email.com'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: 
<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:80:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.professorEmail && 'Professor Email is required. '}
-                            {errors.professorEmail?.type === 'pattern' && 'Professor Email must in the form of an email, e.g. sample@email.com'}
+                            {true && 'Professor Email must in the form of an email, e.g. sample@email.com'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Professor Email must in the form of an email, e.g. sample@email.com</div> instead

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:113:42
                             id="dateRequested"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateRequested)}
-                            {...register("dateRequested", { required: true, pattern: isodate_regex })}
+                            {...register("", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:116:30
                             {...register("dateRequested", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateRequested && 'Request Date is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Request Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:116:30
                             {...register("dateRequested", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateRequested && 'Request Date is required. '}
+                            {errors.dateRequested || 'Request Date is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:131:30
                             {...register("dateNeeded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateNeeded && 'Needed Date is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Needed Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:131:30
                             {...register("dateNeeded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateNeeded && 'Needed Date is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Needed Date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:143:62
                             id="done"
                             type="text"
                             isInvalid={Boolean(errors.done)}
-                            {...register("done", { required: true,  pattern: bool_ragex})}
+                            {...register("done", { required: false,  pattern: bool_ragex})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Done is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:146:30
                             {...register("done", { required: true,  pattern: bool_ragex})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.done && 'Done is required. '}
+                            {errors.done || 'Done is required. '}
                             {errors.done?.type === 'pattern' && 'Done must be true or false'}
                         </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:146:30
                             {...register("done", { required: true,  pattern: bool_ragex})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.done && 'Done is required. '}
+                            {true}
                             {errors.done?.type === 'pattern' && 'Done must be true or false'}
                         </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Done is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:147:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.done && 'Done is required. '}
-                            {errors.done?.type === 'pattern' && 'Done must be true or false'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Done must be true or false/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:147:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.done && 'Done is required. '}
-                            {errors.done?.type === 'pattern' && 'Done must be true or false'}
+                            {errors.done.type === 'pattern' && 'Done must be true or false'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')
