[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:81:22
                 />
                 <Form.Control.Feedback type="invalid">
                     {errors.url?.message}
-                    {errors.url?.type === 'pattern' && 'URL must be a valid web address. '}
+                    {false}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ArticlesForm tests Correct Error messages on bad input for URL Generic bad input
statusReason: Error: Unable to find an element with the text: /URL must be a valid web address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:81:22
                 />
                 <Form.Control.Feedback type="invalid">
                     {errors.url?.message}
-                    {errors.url?.type === 'pattern' && 'URL must be a valid web address. '}
+                    {true}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ArticlesForm tests Correct Error messages on bad input for URL Generic bad input
statusReason: Error: Unable to find an element with the text: /URL must be a valid web address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:108:43
                     id="email"
                     type="text"
                     isInvalid={Boolean(errors.email)}
-                    {...register("email", {
-                        required: "Email is required. ",
-                        pattern: email_regex
-                    })}
+                    {...register("email", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct error messages on bad inputs for email Generic bad-input
statusReason: Error: Unable to find an element with the text: /Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:115:22
                 />
                 <Form.Control.Feedback type="invalid">
                     {errors.email?.message}
-                    {errors.email?.type === 'pattern' && 'Email must be a valid email address. '}
+                    {errors.email?.type === 'pattern' || 'Email must be a valid email address. '}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ArticlesForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Email/

Here are the matching elements:

<label
  class="form-label"
  for="email"
>

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:115:22
                 />
                 <Form.Control.Feedback type="invalid">
                     {errors.email?.message}
-                    {errors.email?.type === 'pattern' && 'Email must be a valid email address. '}
+                    {false}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ArticlesForm tests Correct error messages on bad inputs for email Generic bad-input
statusReason: Error: Unable to find an element with the text: /Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:132:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateAdded && 'Date Added is required. '}
+                    {true}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ArticlesForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Added is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
