[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.js:33:9
             Header: 'id',
             accessor: 'id', // accessor is the "key" in the data
         },
-        {
-            Header: 'Title',
-            accessor: 'title',
-        },
+        {},
         {
             Header: 'URL',
killedBy: ArticlesTables tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.js:49:9
             Header: 'Email',
             accessor: 'email',
         },
-        {
-            Header: 'Date Added',
-            accessor: 'dateAdded',
-        }
+        {}
     ];
 
killedBy: ArticlesTables tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:50:21
             accessor: 'email',
         },
         {
-            Header: 'Date Added',
+            Header: "",
             accessor: 'dateAdded',
         }
killedBy: ArticlesTables tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date Added. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:56:35
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "ArticlesTable"));
+        columns.push(ButtonColumn("", "primary", editCallback, "ArticlesTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "ArticlesTable"));
     }
killedBy: ArticlesTables tests Has the expected column headers and content for adminUser
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:57:35
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "ArticlesTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "ArticlesTable"));
+        columns.push(ButtonColumn("", "danger", deleteCallback, "ArticlesTable"));
     }
 
killedBy: ArticlesTables tests Has the expected column headers and content for adminUser
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:63:17
     return <OurTable
         data={articles}
         columns={columns}
-        testid={"ArticlesTable"}
+        testid={""}
     />;
 };
killedBy: ArticlesTables tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
