[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.js:15:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/articles?id=${id}`],
-            {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-                method: "GET",
-                url: `/api/articles`,
-                params: {
-                    id
-                }
-            }
+            {}
         );
 
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="ArticlesForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.js:18:25
             {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
                 method: "GET",
                 url: `/api/articles`,
-                params: {
-                    id
-                }
+                params: {}
             }
         );
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="ArticlesForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Articles/ArticlesEditPage.js:25:36
         );
 
 
-    const objectToAxiosPutParams = (article) => ({
-        url: "/api/articles",
-        method: "PUT",
-        params: {
-            id: article.id,
-        },
-        data: {
-            title: article.title,
-            url: article.url,
-            explanation: article.explanation,
-            email: article.email,
-            dateAdded: article.dateAdded
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (article) => {
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Article Updated - id: 17 title: sample"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/Articles/ArticlesEditPage.js:40:36
         }
     });
 
-    const onSuccess = (article) => {
-        toast(`Article Updated - id: ${article.id} title: ${article.title}`);
-    }
+    const onSuccess = (article) => {}
 
     const mutation = useBackendMutation(
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/pages/Articles/ArticlesEditPage.js:66:21
             <div className="pt-2">
                 <h1>Edit Article</h1>
                 {
-                    article && <ArticlesForm initialContents={article} submitAction={onSubmit} buttonLabel="Update" />
+                    true
                 }
             </div>
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="ArticlesForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/Articles/ArticlesEditPage.js:66:21
             <div className="pt-2">
                 <h1>Edit Article</h1>
                 {
-                    article && <ArticlesForm initialContents={article} submitAction={onSubmit} buttonLabel="Update" />
+                    article || <ArticlesForm initialContents={article} submitAction={onSubmit} buttonLabel="Update" />
                 }
             </div>
killedBy: ArticlesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="ArticlesForm-title" id="title" name="title" type="text" /> instead
