[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.js:63:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.itemId && 'Item ID is required. '}
-                            {errors.itemId?.type === 'min' && 'Item ID is required to be positive. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Item ID is required to be positive./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.js:63:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.itemId && 'Item ID is required. '}
-                            {errors.itemId?.type === 'min' && 'Item ID is required to be positive. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Item ID is required to be positive./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.js:114:63
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'Stars is required. '}
-                            {(errors.stars?.type === 'min' || errors.stars?.type === 'max') && 'Stars needs to be in between 0 and 5. '}
+                            {(errors.stars?.type === 'min' || false) && 'Stars needs to be in between 0 and 5. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on stars greater than five
statusReason: Error: Unable to find an element with the text: /Stars needs to be in between 0 and 5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] EqualityOperator
main/components/MenuItemReviews/MenuItemReviewForm.js:114:31
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'Stars is required. '}
-                            {(errors.stars?.type === 'min' || errors.stars?.type === 'max') && 'Stars needs to be in between 0 and 5. '}
+                            {(errors.stars?.type !== 'min' || errors.stars?.type === 'max') && 'Stars needs to be in between 0 and 5. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars needs to be in between 0 and 5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
